{
	"https://www.njcourts.gov/jurors/faq#493201": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | I received a Juror Summons. What should I do?",
		"text": " Q. I received a Juror Summons. What should I do? If you received a summons, the first step is to complete the qualification questionnaire. Jurors can complete the qualification questionnaire using the online portal or using the mailed letter version. Jurors who do not have the ability to submit the online qualification questionnaire will automatically be mailed a printed version. The printed qualification questionnaire can be filled out in writing and mailed or emailed back to the county Jury Management office. All jurors must complete the qualification questionnaire even if you are making a request to be excused or rescheduled. After completing the questionnaire, check the Jury Reporting page the night before your summons date for instructions. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": ["https://www.njcourts.gov/jurors/reporting"]
	},
	"https://www.njcourts.gov/jurors/faq#828316": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | How do I log into the juror portal?",
		"text": " Q. How do I log into the juror portal? Do not set up a new account. An account is already set up for you. Use the 10-digit Participant ID and 5-digit zip code from your summons to log into the My Jury Service portal. Your User ID is your 10-digit Participant ID (include all zeros. e.g. 0001234567). Your Password is your 5-digit zip code. For more information on logging into the MyJuryService Portal visit: Quick Reference Guide – My Jury Service (MJS) ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": [
			"https://www.njcourts.gov/sites/default/files/jurors/quickreferenceguide-jury.pdf",
			"https://www.njcourts.gov/jurors/service"
		]
	},
	"https://www.njcourts.gov/jurors/faq#263346": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | What should I do if I lost my Juror Questionnaire/Summons?",
		"text": " Q. What should I do if I lost my Juror Questionnaire/Summons? If you misplace your Juror Summons or Juror Questionnaire, you should contact the Jury Management Office in your county for a replacement. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": ["https://www.njcourts.gov/jurors/contact"]
	},
	"https://www.njcourts.gov/jurors/faq#493216": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | How do I update my address?",
		"text": " Q. How do I update my address? Jurors may update their address two ways: Jurors who completed their Juror Questionnaire online can update their address through the juror portal under the personal contact information section. Jurors mailing in the printed version of the Juror Questionnaire can update their address on this form under the “Other Information” section. Check the box for address change and write your new address on the line provided. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263416": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | Is my employer required to pay me when I have jury service?",
		"text": " Q. Is my employer required to pay me when I have jury service? In New Jersey there is no statutory requirement that a private employer pay your salary during juror service. Whether or not your employer pays you for jury duty depends on your employment situation, including employers' policies, union contracts, etc. The State of New Jersey will pay you the appropriate juror fee as set forth in the New Jersey statutes. The Jury Management Office is aware that many employers do not pay their employees during jury duty. If service as a juror will create a severe financial hardship, as set forth in N.J.S.A. 2B:20-10, you may request to be excused. But please be aware that nonpayment by your employer, by itself, is not a valid reason to be excused from service. Each situation will be reviewed individually. If you are employed full time by the State of New Jersey, you will receive your usual compensation while you serve as a juror. However, in accordance with N.J.S.A. 2B:20-16 you will not receive juror payment. This law applies to persons employed full time by any agency, independent authority, instrumentality of the State of any political subdivision of the State (such as counties or municipalities). Jurors affected by this policy should notify the Jury Management Office when they report for service. If a check is issued to you in error, you will be required to return it to the Jury Management Office. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263421": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | Can I be penalized by my employer for serving on jury duty?",
		"text": " Q. Can I be penalized by my employer for serving on jury duty? N.J.S.A. 2B:20.17 prohibits an employer from penalizing you because you serve as a juror. Penalties for a violation of this statute include the possibility of a criminal charge, as a disorderly person’s offense, and a possible civil action for monetary damages and for reinstatement of employment. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263386": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | What are the penalties for failing to report for jury service?",
		"text": " Q. What are the penalties for failing to report for jury service? Failure to respond to the summons will result in further court action. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#493206": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | How will I know if the court is closed due to inclement weather?",
		"text": " Q. How will I know if the court is closed due to inclement weather? During inclement weather situations, all jurors, should check the State Court Closing Information page prior to reporting to the courthouse. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": [
			"https://www.njcourts.gov/public/news-media/court-closings"
		]
	},
	"https://www.njcourts.gov/jurors/faq#263356": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | What should I do if I am summoned but no longer live in the county that summoned me or in New Jersey?",
		"text": " Q. What should I do if I am summoned but no longer live in the county that summoned me or in New Jersey? If you no longer live in New Jersey or received a Juror Summons from a county you no longer reside in, you must complete the Juror Questionnaire. You will be asked about your residency on question one. Completing the Juror Questionnaire will allow the Jury Management Office to update your jury system record, which will prevent later enforcement efforts if there is no response to the summons (since N.J statutes require a response). The Judiciary is required, for jury selection purposes, to merge lists of registered voters, licensed drivers, New Jersey personal income tax filers. Non-residents can be summoned when changes are delayed during list processing or if record holders have not updated their records. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263426": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | Can I collect unemployment while serving as a juror for New Jersey?",
		"text": " Q. Can I collect unemployment while serving as a juror for New Jersey? You may still collect unemployment benefits while serving as a juror. N.J.S.A. 43:21-4(c)(5) protects a person's unemployment benefits during juror service. That statute states the following: (5) An unemployed individual, who is otherwise eligible, shall not be deemed unavailable for work or ineligible solely by reason of the individual's attendance before a court in response to a summons for service on a jury. If an employment interview is scheduled on a day on which you need to report for juror service, notify the Jury Management Office, in advance if possible, and your service will be rescheduled to a later date. Please be aware that verification may be required. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263326": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | Why is it important that I serve as a juror?",
		"text": " Q. Why is it important that I serve as a juror? Jurors are an essential part of our justice system. The right to trial by jury in the United States dates from Colonial times and is rooted in English history. It is guaranteed by the Sixth and Seventh Amendments to the Constitution of the United States of America and Article One of New Jersey’s State Constitution. People have a right to have matters determined by a jury of their peers. Participating in our judicial system is not only an honor, but is also one of our civic duties. Although juror service may be inconvenient, citizens must participate in the jury process in order for it to work. Cases that go to trial need to be resolved by citizens who hear the evidence, determine the facts and render a verdict. It is impossible to get a fair cross-section of the community to participate in the jury system if people do not report for jury service. If you ever found yourself or a loved one involved in a civil or criminal trial, it's likely that you would want a jury of fellow citizens who will be fair and impartial. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263391": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | How do I reschedule my jury service date?",
		"text": " Q. How do I reschedule my jury service date? Jurors must complete the qualification questionnaire using the online portal or mailed letter version prior to submitting a rescheduling request. Reschedule requests can be submitted using the online portal or by completing the “Other Information” section on the bottom of the mailed questionnaire. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#493196": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | How do I request to be excused from jury service?",
		"text": " Q. How do I request to be excused from jury service? Jurors must complete the qualification questionnaire using the online portal or mailed letter version prior to submitting an excusal request. Excusal requests can be submitted using the online portal or by completing the excusal section on the bottom of the mailed questionnaire. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263381": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | Who can be excused from jury service?",
		"text": " Q. Who can be excused from jury service? N.J.S.A. 2B:20-10 sets forth grounds for which a person can request to be excused from jury service. You may request to be excused from jury service you if fall into one of the categories below. You are 75 years of age or older. You will be required to provide your DOB the Jury Management Office. You have served as a juror in the same county within the last three years. You will be required to provide the date you served. You believe that you will suffer a severe financial hardship. In order to be excused for financial reasons, you must show that serving as a juror will cause a severe financial hardship that will compromise your ability to support yourself and/or your dependents. You will also be required to submit to the Jury Management Office a certification (sworn statement) listing the sources of your household income; whether you will be paid during jury service; and the impact of the length of service. Jurors who report for service may speak with the trial judge regarding any financial hardships based on the anticipated length of the trial. You have a medical inability to serve as a juror. If you suffer from a medical condition that is unlikely to change within a year, and this condition prevents you from serving on jury duty, you may request to be excused or rescheduled. You and your doctor will be required to complete the Physician certification in Support of Medical Excuse Request certification. The Judiciary will also accept a note from a doctor that states the juror has a medical condition and the duration that this condition prevents them from serving jury duty. The court may request additional, non-confidential information if necessary to determine a request for an excusal. You care for a minor child, or a sick, aged, or infirm dependent, and have no alternative care available without suffering severe financial hardship. When requesting to be excused for any of these circumstances, keep in mind that the Jury Management Office will grant you time to arrange for alternative care. Please be aware that the Judiciary will accommodate mothers who are breastfeeding and will provide a suitable private location for their use during the day. The Jury Management Office will also require supplemental documentation for excusal requests as indicated below: If you are requesting an excuse based upon a personal obligation to care for a sick, aged, or infirm dependent, you must submit a doctor’s note from a licensed physician stating that you are the sole caregiver and your continued presence is essential to the regular and personal treatment of that person. If you are requesting an excuse based upon a personal obligation to care for a minor child or children, you must submit to the Jury Management Office the certification which states you are personally obligated to care for the minor child(ren). By completing this certification, you acknowledge that the court may require further information and/or financial documentation in support of the request. You provide highly specialized technical healthcare services for which a replacement cannot reasonably be obtained. The Jury Management Office will require proof of licensing as a healthcare provider and a letter from your employer verifying that no coverage can be reasonably obtained. You are a healthcare worker directly involved in the care of a person with a mental or physical disability, and your continued presence is essential to the regular and personal treatment of that person. You will be required to provide a letter from your employer verifying that your continued presence is essential to the regular and personal treatment of the person. You are full-time teacher of a grammar/high school during the school year for which a replacement cannot be reasonably obtained. You will be required to submit a letter from your school superintendent confirming you are full time instructional staff and indicating either an excuse is necessary due to the volume of teachers called at the time or you are a special education teacher and it is essential for you to be in attendance. Other teachers who cannot find a replacement, may reschedule their service. You are an active member of a volunteer fire department, fire patrol, first aid or rescue squad. The Jury Management Office will require a letter on letterhead from your fire captain/EMT squad captain; or identification showing active volunteer status (must not be expired). You are on active duty as a member of the United States military. In order to be excused from jury service, you must be on active duty on the summons date and the military service must be in the United States military, which includes members of the National Guard who are assigned to active duty. You should provide information relating to your current assignment, such as a copy of your orders, a letter from your commanding officer, or a copy of your ID card indicating an active duty assignment. The Judiciary thanks you for your service. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": [
			"https://www.njcourts.gov/sites/default/files/forms/12140_jury_duty_childcare.pdf",
			"https://www.njcourts.gov/sites/default/files/forms/12255_jury_financial_hardship.pdf",
			"https://www.njcourts.gov/sites/default/files/forms/12308_physician_cert.pdf"
		]
	},
	"https://www.njcourts.gov/jurors/faq#866056": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | Do I get paid for on-demand orientation?",
		"text": " Q. Do I get paid for on-demand orientation? No, jurors participating in the on-demand orientation do not receive compensation for completing that online orientation. The on-demand orientation is designed to be a convenient alternative for jurors instead of in-person orientation. It allows you to prepare for jury service at your convenience, without the need to physically report to a courthouse. We appreciate your commitment to civic duty by participating in the on-demand orientation. You will be compensated for the portions of your jury service that follow the on-line orientation. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#904661": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | What should I do if I feel sick?",
		"text": " Q. What should I do if I feel sick? If you feel sick, do not report to the courthouse. Instead, contact your local jury management office to reschedule your service. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": ["https://www.njcourts.gov/jurors/contact"]
	},
	"https://www.njcourts.gov/jurors/faq#263336": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | How are prospective jurors selected to be summoned?",
		"text": " Q. How are prospective jurors selected to be summoned? Prospective jurors are randomly selected by computer. If selected, a juror is mailed a green postcard summons. In certain instances, jurors will also be mailed a follow-up notice that includes a printed Juror Questionnaire. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263406": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | How can I obtain proof that I served as a juror?",
		"text": " Q. How can I obtain proof that I served as a juror? Jurors who completed the Juror Qualification Questionnaire online can print an attendance letter through the juror portal. If you are unable to your print letter from the portal, your Jury Management Office can provide you with an attendance letter. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": ["https://www.njcourts.gov/jurors/contact"]
	},
	"https://www.njcourts.gov/jurors/faq#263371": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | Does recent service in another state excuse me from serving as a juror in New Jersey?",
		"text": " Q. Does recent service in another state excuse me from serving as a juror in New Jersey? Recent service in another state does not excuse you from serving in New Jersey. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263441": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | Will I be screened for weapons when entering the Superior Court Courthouse?",
		"text": " Q. Will I be screened for weapons when entering the Superior Court Courthouse? In order to ensure the safety of those entering NJ courthouses, all persons, including jurors, are screened when entering a NJ Superior Court courthouse. Chemical agents, pepper sprays, or anything resembling a weapon, including scissors, will not be permitted into the Courthouse - for the safety of the public. Also, be aware that all metal objects will activate the metal detector and will need to be placed in the trays before passing through the metal detector. If the metal detector is activated as you pass through, you will be screened by an officer using a handheld metal detector. Purses and other carried items, such as briefcases and backpacks will be x-rayed. Any illegal items will be confiscated. The fewer metal items you are carrying, the faster you will pass through the screening process. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263341": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | Why do I seem to get summoned for jury duty more frequently than others?",
		"text": " Q. Why do I seem to get summoned for jury duty more frequently than others? Each juror record has the same chance of being selected at any time. As a result, some jurors may find they are summoned more frequently than others. If you have been summoned in the same county within the past three years, you may request to be excused from jury service. Please see \"How do I request to be excused from jury service?\" for instructions on requesting an excusal. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263411": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | When will I get paid for jury service in New Jersey?",
		"text": " Q. When will I get paid for jury service in New Jersey? Juror payrolls are processed each Friday, except holidays. Therefore, a juror may receive more than one check if that juror served in different weeks. Jurors paid $600 or more for their term of service will receive a 1099 form for taxes from the New Jersey Department of the Treasury. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263376": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | What are the qualifications to serve as a juror in New Jersey?",
		"text": " Q. What are the qualifications to serve as a juror in New Jersey? N.J.S.A. 2B:20-1 establishes six criteria for a person to qualify for jury service: be a resident of New Jersey; be a citizen of the United States; be physically and mentally able to perform the functions of a juror (noting that the Judiciary will provide accommodations consistent with the Americans with Disabilities Act); have no conviction for an indictable offense Examples of persons who would be disqualified are anyone who was convicted of, or pled guilty to, a crime in Federal Court or Superior Court; or anyone currently on PTI (Pre-trial Intervention Program.) Examples of persons who would qualify to serve jury duty are anyone whose only convictions are in Municipal Court (most traffic violations fall into this category, as do most shoplifting charges;) or anyone who has been accused of a crime but has not yet been convicted or has yet to enter a guilty plea. Also, traffic offenses, juvenile and DWI related offenses that occurred in New Jersey are not grounds for disqualification. You are not disqualified with respect to criminal record if you successfully completed a Pre-Trial Intervention program (PTI) for an offense and have not been convicted or pled guilty to another disqualifying offense. be at least 18 years of age; and be able to read and understand the English language ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263351": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | I received a Juror Summons for a family member that has passed. What should I do?",
		"text": " Q. I received a Juror Summons for a family member that has passed. What should I do? If you receive a Juror Summons or Juror Questionnaire addressed to a person who is deceased, please contact the summoning Jury Management Office. This will allow the Judiciary to make the record ineligible for future selection. By law, the Judiciary annually receives records from the New Jersey Department of Taxation, Motor Vehicle Commission, and Division of Elections for the master jury list. Please make sure to notify those agencies to avoid a record mistakenly coming to the Judiciary in the future. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": ["https://www.njcourts.gov/jurors/contact"]
	},
	"https://www.njcourts.gov/jurors/faq#493211": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | How do I know if I need to report for jury duty?",
		"text": " Q. How do I know if I need to report for jury duty? To determine if you are required to report for jury duty, visit the Juror Reporting Page after 5:00 p.m. the evening before your summons date. Jurors may also receive email or text messages regarding their service. This service is not available to jurors who opted out of receiving messages. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": ["https://www.njcourts.gov/jurors/reporting"]
	},
	"https://www.njcourts.gov/jurors/faq#263361": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | What are the different types of juror service in New Jersey?",
		"text": " Q. What are the different types of juror service in New Jersey? You may be summoned for one of three types of jury service. You may be summoned to serve as a Petit Juror, a Grand Juror, or a State Grand Juror. Petit Jury service includes criminal and civil trials. Petit jurors who sit on a criminal trial decide guilt or innocence in a criminal matter. Petit jurors who sit on a civil trial decide liability or damages. Grand Jury determine whether there is enough evidence to move forward with criminal charges against a defendant. State Grand Jury and county grand jury operate similarly but the State Grand Jury has statewide jurisdiction and representation and meets in Trenton rather than one of the county seats. Please also be aware that you may be summoned to serve as a federal petit juror or grand juror in U.S. District Court. Such service is independent of N.J. Superior Court jury service. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263431": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | Is there a dress code for jurors reporting?",
		"text": " Q. Is there a dress code for jurors reporting? Jurors reporting for service should wear clothing appropriate for an appearance in court. Shorts, t-shirts, uniforms or clothing containing statements or offensive symbols are not permitted. All hats must be removed when in a courtroom. Comfortable clothing is also advisable. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263331": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | Where does the list of jurors come from?",
		"text": " Q. Where does the list of jurors come from? The Judiciary is required by statute to create a single list for juror selection that combines names of registered voters, licensed drivers, filers of N.J. personal income tax returns. Citizens can assist in this process by using their legal name when filing relevant forms and checking to ensure that all information, including address and identifiers, is accurate. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263401": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | How much do I get paid for jury service?",
		"text": " Q. How much do I get paid for jury service? Petit jurors are paid $5 dollars for each day of service. If a petit juror serves more than three days, the pay rate will increase to $40 per day beginning on the fourth day. Grand jurors are paid $5 dollars for each day of service. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": []
	},
	"https://www.njcourts.gov/jurors/faq#263366": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | Does recent service as a federal juror affect my scheduled service in the New Jersey Superior Court?",
		"text": " Q. Does recent service as a federal juror affect my scheduled service in the New Jersey Superior Court? Recent service as a federal juror does not automatically relieve you from your petit jury civic obligation but you may provide that information to your summoning Jury Management Office. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": ["https://www.njcourts.gov/jurors/contact"]
	},
	"https://www.njcourts.gov/jurors/faq#263436": {
		"source": "website",
		"title": "Frequently Asked Questions About Jury Service | NJ Courts | Where can I find public transportation information and/or driving directions for Juror Service?",
		"text": " Q. Where can I find public transportation information and/or driving directions for Juror Service? Public transportation information can be found on the NJ Transit website. Specific destination and parking information for jurors is available on the jury reporting page for your county. ",
		"is_file": false,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors"
		],
		"child_pages": ["https://www.njcourts.gov/jurors/reporting"]
	},
	"https://www.njcourts.gov/jurors/reporting": {
		"source": "website",
		"title": "Reporting Information | NJ Courts",
		"text": " Reporting Information Home Jurors If you feel sick, do not report to the courthouse. Instead, contact your local jury management office to reschedule your service. Check Jury Reporting State Grand Jury Atlantic Bergen Burlington Camden Cape May Cumberland Essex Gloucester Hudson Hunterdon Mercer Middlesex Monmouth Morris Ocean Passaic Salem Somerset Sussex Union Warren ",
		"is_file": false,
		"child_pages": [
			"https://www.njcourts.gov/jury-reporting-messages/state-grand-jury",
			"https://www.njcourts.gov/jury-reporting-messages/camden",
			"https://www.njcourts.gov/jury-reporting-messages/morris",
			"https://www.njcourts.gov/jury-reporting-messages/sussex",
			"https://www.njcourts.gov/jury-reporting-messages/mercer",
			"https://www.njcourts.gov/jury-reporting-messages/salem",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jury-reporting-messages/hudson",
			"https://www.njcourts.gov/jury-reporting-messages/passaic",
			"https://www.njcourts.gov/jury-reporting-messages/middlesex",
			"https://www.njcourts.gov/jury-reporting-messages/somerset",
			"https://www.njcourts.gov/",
			"https://www.njcourts.gov/jury-reporting-messages/atlantic",
			"https://www.njcourts.gov/jurors",
			"https://www.njcourts.gov/jury-reporting-messages/burlington",
			"https://www.njcourts.gov/jury-reporting-messages/essex",
			"https://www.njcourts.gov/jury-reporting-messages/ocean",
			"https://www.njcourts.gov/jury-reporting-messages/bergen",
			"https://www.njcourts.gov/jury-reporting-messages/union",
			"https://www.njcourts.gov/jury-reporting-messages/cumberland",
			"https://www.njcourts.gov/jury-reporting-messages/cape-may",
			"https://www.njcourts.gov/jury-reporting-messages/hunterdon",
			"https://www.njcourts.gov/jury-reporting-messages/monmouth",
			"https://www.njcourts.gov/jury-reporting-messages/warren",
			"https://www.njcourts.gov/jury-reporting-messages/gloucester"
		],
		"parent_pages": [
			"https://www.njcourts.gov/jurors/faq#263436",
			"https://www.njcourts.gov/jurors",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/node/493161",
			"https://www.njcourts.gov/jurors/faq#493211",
			"https://www.njcourts.gov/jurors/faq#493201"
		]
	},
	"https://www.njcourts.gov/jurors": {
		"source": "website",
		"title": "Jurors | NJ Courts",
		"text": " Jurors Learn about jury service and sign up to serve. How do I ... Answer a jury notice? Avoid a jury scam? Certify my mandatory juror orientation video? Contact the jury manager? Watch a video about jury service? Watch a video on jurors' use of websites and social media? Complete Your Questionnaire Did you receive a jury notice? Respond online and find out more about your upcoming jury service. Contact Jury Management Office Find contact information for your local jury management office. Reporting Information Getting daily reporting message, directions and parking info, dress code, courthouse regulations, and more. General Jury Information Find important information about your jury service, such as court closings, what qualifies you to be a juror, phone use in the courthouse, jury scams, and more. Excusal Requests and Required Documentation Find the certification request forms being requested by your summoning jury management office. Reschedule Requests View the reasons accepted by your summoning jury management office when requesting a deferral (reschedule). State Grand Jury Learn about the state grand jury process Virtual Orientation Instructions Instructions and troubleshooting when using Zoom for jury service. Frequently Asked Questions About Jury Service Find answers to many common questions asked by our jurors. ",
		"is_file": false,
		"child_pages": [
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/jurors/reporting"
		],
		"parent_pages": [
			"https://www.njcourts.gov/jurors/reporting",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/node/493161"
		]
	},
	"https://www.njcourts.gov/jurors/videoconference-instructions": {
		"source": "website",
		"title": "Videoconference Instructions | NJ Courts",
		"text": " Videoconference Instructions Home Jurors Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Section Menu New Jurors should check their county's reporting page (Reporting Information | NJ Courts) to determine if they need to report virtually or in-person. Jurors reporting virtually will be sent a Zoom link the day before the summons date. Please read below for further instructions on using Zoom. On This Page Body Add Zoom to your device.Zoom will work with any Mac or Windows computer or laptop. It also will work with any iOS or Android mobile device, such as a smartphone or tablet.To make sure the virtual jury selection process goes smoothly, please:Install the latest version of Zoom on your computer, laptop or mobile device (smartphone or tablet).Test Zoom before your jury selection day and report any issues to your local jury management office.Make sure your name in Zoom matches your driver’s license or other official ID.Make sure your audio and video both work.Test Zoom before your reporting date.You can print the step-by-step instructions below to help you with test.Instructions for testing Zoom that is installed on computers and laptops.Instructions for testing Zoom using a web browser on computers and laptops.Instructions for testing Zoom on iPhones and iPads.Instructions for testing Zoom on Android cell phones and tablets.Review Zoom checklist.I have a computer, laptop, or mobile device (smartphone or tablet) with a good connection to power and to the Internet.My computer, laptop, or mobile device has working speakers and camera OR I have a separate webcam.I have tested my microphone and speakers with Zoom and both are working.I have downloaded and installed the latest version of the Zoom Client for Meetings from https://zoom.us/download for my computer or laptop, or I have downloaded the Zoom app from the Apple App Store or the Google Play Store for the mobile device I will use for jury selection.I have performed a Zoom test by visiting https://zoom.us/test and followed the guide in the left menu (called Testing Zoom) to test the device I will be using. I am familiar with the Zoom screen options and know how to use the video on/off and mute/unmute buttons. If you are using headphones or a webcam, make sure they are plugged in before you test.My name in Zoom is the same as my driver’s license or other official ID.I have removed all personal photos and other personal items from my background so that they will not show during jury selection. I have found an area of my home with minimum background noise.TroubleshootingVisit https://zoom.us/support for how-to guides and tutorials. If you are unable to solve your technical issue or have further questions, contact your local Jury Management office. If you did not get the Zoom meeting invite, check your email’s spam filter. If you don’t see the invite there, contact your local jury management office. After you join the Zoom meeting, you will be in the waiting room. You will not see anyone else in the waiting room. This is normal. The Zoom moderator court staff will let you into the meeting when they are ready.To rename yourself in Zoom while using a computer or laptop: While in a test Zoom session (https://zoom.us/test) click on \"Participants'\".Move your mouse over your name, choose \"More,\" then \"Rename.\"Enter your name as it appears on your driver’s license or other official ID, check \"Remember my name for future meetings,\" then click \"OK.\"To rename yourself in Zoom while using a mobile device:While you are in a test Zoom session (https://zoom.us/test), tap on \"Participants.\"Find your name in the list of participants.Tap on your name and select \"Rename.\"Type in your name as it appears on your driver’s license or other official ID, then tap \"Done.\" ",
		"is_file": false,
		"child_pages": [
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/sites/default/files/jurors/testingzoomweb.pdf",
			"https://www.njcourts.gov/",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/node/493161",
			"https://www.njcourts.gov/sites/default/files/jurors/testingzoomios.pdf",
			"https://www.njcourts.gov/jurors",
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/sites/default/files/jurors/testingzoomcomp.pdf",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jurors/reporting",
			"https://www.njcourts.gov/sites/default/files/jurors/testingzoomandroid.pdf"
		],
		"parent_pages": [
			"https://www.njcourts.gov/jurors",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/node/493161"
		]
	},
	"https://www.njcourts.gov/sites/default/files/jurors/testingzoomandroid.pdf": {
		"source": "website",
		"title": "testingzoomandroid.pdf",
		"text": "",
		"child_pages": [],
		"is_file": true,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/videoconference-instructions"
		]
	},
	"https://www.njcourts.gov/jurors/contact": {
		"source": "website",
		"title": "Jury Management Office Contact List | NJ Courts",
		"text": " Jury Management Office Contact List Home Jurors Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Section Menu If you are calling about jury service, be prepared to provide your name, and the nine digit number shown under the bar code on your juror summons. That information will allow Jury Management Office staff to answer your questions more quickly and more directly. For State Grand Jury in Trenton, please contact jury staff at 609-571-4497 or send an email to sgjury.mailbox@njcourts.gov . Name Address Contact (s) AtlanticFeliciano, Geovanny Jury ManagerAtlantic CityAtlantic Atlantic County Civil Courts Building1201 Bacharach Blvd.Floor 1 Atlantic City, New Jersey 08401 Phone: 609-402-0100 ext. 47930 Email: atljuryac.mbx@njcourts.gov AtlanticHeadley, Janice Jury ManagerMays LandingAtlantic Atlantic County Criminal Courts Complex4997 Unami Blvd.Floor 1 Mays Landing, New Jersey 08330 Phone: 609-402-0100 ext. 47940 Email: Atljury.Mailbox@njcourts.gov BergenFigueroa, Lourdes Jury ManagerBergen Bergen County Justice Center10 Main StreetFloor 5 Hackensack, New Jersey 07601 Phone: 201-221-0700 ext. 25090 Email: Berjury.Mailbox@njcourts.gov BurlingtonWilson, Lisa Jury ManagerBurlington Courts Facility49 Rancocas RoadFloor 5 Mount Holly, New Jersey 08060 Phone: 609-288-9500 ext. 38031 Email: Burjury.Mailbox@njcourts.gov CamdenMatlock, Lashonna Jury ManagerCamden Camden County Hall of Justice101 South 5th StreetFloor 6 Camden, New Jersey 08103 Phone: 856-650-9085 Email: Camjury.Mailbox@njcourts.gov Cape MayFeliciano, Geovanny Jury ManagerCape May Cape May County Courthouse9 North Main StreetFloor 1 Cape May Courthouse, New Jersey 08210 Phone: 609-402-0100 ext. 47950 Email: Cpmjury.Mailbox@njcourts.gov CumberlandBuonogaimari, Maria Jury Manager - CumberlandCumberland Cumberland County Courthouse60 West Broad StreetFloor 2 Bridgeton, New Jersey 08302 Phone: 856-878-5050 ext. 15160 Email: Cumjury.Mailbox@njcourts.gov EssexBrooks, Rachel Jury ManagerEssex Essex County Veterans Courthouse50 West Market StreetFloor 8 Newark, New Jersey 07102 Phone: 973-776-9300 ext. 56887 Email: Esx-jury.Mailbox@njcourts.gov GloucesterCline, Ashley Jury Manager - GloucesterGloucester Gloucester County Justice Complex70 Hunter StreetFloor 1 Woodbury, New Jersey 08096 Phone: 856-878-5050 ext. 15180 Email: Glojury.Mailbox@njcourts.gov HudsonOrtiz, Raquel Jury ManagerHudson Hudson County Administration Bldg595 Newark AvenueFloor 4 Jersey City, New Jersey 07306 Phone: 201-748-4400 ext. 60560 Email: Hudjury.Mailbox@njcourts.gov HunterdonGuinan, Amy Jury Manager - HunterdonHunterdon Hunterdon County Justice Center65 Park AvenueFloor 1 Flemington, New Jersey 08822 Phone: 908-824-9750 ext. 13030 Email: Hntjury.Mbx@njcourts.gov MercerSeidl, Dale Jury ManagerMercer Mercer County Civil Courthouse175 South Broad StreetFloor 2 Trenton, New Jersey 08650-0068 Phone: 609-571-4200 ext. 74375 Email: Merjury.Mailbox@njcourts.gov MiddlesexSeide, Vanessa Jury ManagerMiddlesex Middlesex County Courthouse56 Paterson StreetFloor 1 New Brunswick, New Jersey 08903-0964 Phone: 732-645-4300 ext. 88630 Email: Midjury.Mailbox@njcourts.gov MonmouthD'Annunzio, Francesca Jury ManagerMonmouth Monmouth County Courthouse71 Monument StreetFloor 1 Freehold, New Jersey 07728 Phone: 732-358-8700 ext. 87075 Email: Monjury.Mailbox@njcourts.gov MorrisPerez, Elvin Jury ManagerMorris Morris County CourthouseWashington and Court StreetsMorristown, New Jersey 07960-0910 Phone: 862-397-5700 ext. 75060 Email: Mrsjury.Mailbox@njcourts.gov OceanRiley, Karen Jury ManagerOcean Ocean County Courthouse100 Hooper AvenueFloor 2 Toms River, New Jersey 08754 Phone: 732-504-0633 Email: Ocnjury.Mailbox@njcourts.gov PassaicCaltagirone, Stacey Jury ManagerPassaic Passaic County Admin Building401 Grand StreetSuite/Room 325, Floor 3rd Floor Paterson, New Jersey 07505 Phone: 973-653-2980 Email: Pasjurymgmt.Mailbox@njcourts.gov SalemHolmes, Diane Jury Manager - SalemSalem Salem County Courthouse92 Market StreetFloor Lower Level Salem, New Jersey 08079 Phone: 856-878-5050 ext. 15760 Email: Slmjury.Mailbox@njcourts.gov SomersetBrevic, Jason Jury Manager - SomersetSomerset Somerset County Courthouse20 North Bridge StreetFloor 2 Somerville, New Jersey 08876 Phone: 908-332-7700 ext. 13025 Email: Somjury.mbx@njcourts.gov SussexStolzenberger, Karen Jury ManagementSussex Sussex County Judicial Center43-47 High StreetNewton, New Jersey 07860 Phone: 862-397-5700 ext. 75080 Email: Ssxjury.Mailbox@njcourts.gov UnionTenBroeck, William Jury ManagerUnion Union County Courthouse2 Broad StreetFloor 1 Elizabeth, New Jersey 07207 Phone: 908-787-1650 ext. 84620 Email: Unnjury.mailbox@njcourts.gov WarrenMurzdeck, Christine Jury ManagerWarren Warren County Courthouse413 Second StreetFloor 2 Belvidere, New Jersey 07823 Phone: 908-750-8100 ext. 13010 Email: wrnjury.mbx@njcourts.gov Total results: 22 ",
		"is_file": false,
		"child_pages": [
			"https://www.njcourts.gov/courts/vicinages/atlantic-cape-may",
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/courts/vicinages/cumberland-gloucester-salem",
			"https://www.njcourts.gov/courts/vicinages/burlington",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/courts/vicinages/somerset-hunterdon-warren",
			"https://www.njcourts.gov/courts/vicinages/morris-sussex",
			"https://www.njcourts.gov/courts/vicinages/bergen",
			"https://www.njcourts.gov/courts/vicinages/mercer",
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/courts/vicinages/middlesex",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/courts/vicinages/monmouth",
			"https://www.njcourts.gov/courts/vicinages/union",
			"https://www.njcourts.gov/",
			"https://www.njcourts.gov/courts/vicinages/essex",
			"https://www.njcourts.gov/courts/vicinages/passaic",
			"https://www.njcourts.gov/jurors",
			"https://www.njcourts.gov/courts/vicinages/atlantic-city",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/courts/vicinages/ocean",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/courts/vicinages/camden",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/reporting",
			"https://www.njcourts.gov/courts/vicinages/hudson"
		],
		"parent_pages": [
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/node/493161",
			"https://www.njcourts.gov/jurors",
			"https://www.njcourts.gov/jurors/reporting",
			"https://www.njcourts.gov/jurors/faq#263366",
			"https://www.njcourts.gov/jurors/faq#263351",
			"https://www.njcourts.gov/jurors/faq#263406",
			"https://www.njcourts.gov/jurors/faq#904661",
			"https://www.njcourts.gov/jurors/faq#263346"
		]
	},
	"https://www.njcourts.gov/jurors/rescheduling-requests": {
		"source": "website",
		"title": "Rescheduling Requests | NJ Courts",
		"text": " Rescheduling Requests Home Jurors Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Section Menu Deferral Requests (Rescheduling Your Service)Complete the juror qualification questionnaire before submitting a request to be deferred.Deferral requests may be submitted for the following needs:MedicalProspective juror has a temporary medical inability to serve. TransportationProspective juror is unable to secure transportation for their reporting date. Temporarily Outside of Area – Business or Vacation TripProspective juror is temporarily out of area for employment, vacation or holiday reasons Temporarily Outside of Area – College StudentProspective juror is a student and is temporarily out of area for schooling and/or prospective juror is a student with mandatory classes, exams, evaluations, or other school obligations. Temporarily Outside of Area – OtherFor reasons other than those mentioned above. EmergencyProspective juror has an emergent and unplanned event that requires immediate attention Employment – Probationary Period, Staff Shortage, etc.Prospective juror has an employment conflict or is under a probationary period for new employment.You can defer (reschedule) your jury service once in the My Jury Service Portal, or by contacting your jury management office. Requesting a Deferral Using the Online PortalHow-to video: How to Create a Juror Service RequestLog into the My Jury Service Portal to complete your questionnaire.Once complete, you will be taken to the Home page. Click on the “Juror Service Request” tile.Select “Create Juror Service Request.”Select “Deferral.”Under “Deferral Month” select the month you would like to be deferred to.Under “Available deferral dates” select your preferred date.Under “Deferral reason” select the reason for your request.Under “Additional Notes” you are free to add any information you would like to provide regarding your request.Click “Submit” at the bottom of the page.If additional information is required, you will be notified via email for the requested documentation. The information can be submitted via email to your summoning jury management office.You will be notified by email once a decision has been made.*Note: If additional information is required and not received five days prior to your summons date, your request will be denied and you will be required to report for your scheduled jury service.If you do not have access to the online portal, please email or call your jury management office.When calling by phone, have your 10-Digit Participant ID available.When emailing your request, provide the following:10-Digit Participant IDFull nameRequested deferral dateDeferral reasonContact phone number ",
		"is_file": false,
		"child_pages": [
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors",
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/jurors/reporting"
		],
		"parent_pages": [
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/node/493161",
			"https://www.njcourts.gov/jurors"
		]
	},
	"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury": {
		"source": "website",
		"title": "New Jersey State Grand Jury | NJ Courts",
		"text": " New Jersey State Grand Jury Home Jurors Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Section Menu State Grand Jury is a statewide program with jurors summoned from every county in New Jersey. If you are selected as a grand juror, you will serve one day a week for 16 to 20 weeks. State Grand Jury is managed by the Mercer County Jury Management Office.Complete the required questionnaire promptly.Once you receive your State Grand Jury summons, you MUST complete the qualification questionnaire at least 30 days prior to your reporting date.Enter the 10-digit Participant ID number shown under the barcode (Not the Juror Number) of your summons, and your mailing address zip code listed on the summons.Through this questionnaire, you can request to be disqualified, excused, or rescheduled (deferred).Once you have entered all your answers, you must select \"Confirm,\" or your information will not be received and correctly processed.If you are submitting the qualification questionnaire by mail, please make sure to include your email address and contact phone number in the required fields on the form.RequestsIf you are requesting to be disqualified, excused, or rescheduled, you can send supporting documentation to sgjury.mailbox@njcourts.gov , or mail it to the Mercer County Civil Courthouse 175 South Broad Street Floor 2 Trenton, New Jersey 08650-0068 Documentation must be received by the jury management office at least 30 days prior to your summons date.State grand jurors are currently selected virtually using the following process:Step 1 - Jury summonses are mailed to potential state grand jurors. Jurors must complete the qualification questionnaire. Those who do not promptly respond online will be sent a questionnaire in the mail.Step 2 - About one month prior to the service date, only 100 potential jurors will be selected to appear from all those who responded and were qualified to serve. An email will be sent to all qualified jurors informing them whether they have been selected and must appear, or they were not selected and are excused.Step 3 - The Mercer County Jury Management Office will email jurors Zoom instructions prior to the appearance date.Step 4 - The Mercer County Jury Management Office will email jurors a Zoom invitation link for virtual jury selection the day before the appearance date. If you have questions and would like to speak with someone by phone, you can call 609-571-4200 ext. 74375 or send an email to sgjury.mailbox@njcourts.gov . ",
		"is_file": false,
		"child_pages": [
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors",
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/jurors/reporting"
		],
		"parent_pages": [
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/node/493161",
			"https://www.njcourts.gov/jurors"
		]
	},
	"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams": {
		"source": "website",
		"title": "Protect Yourself Against Jury Duty Scams | NJ Courts",
		"text": " Protect Yourself Against Jury Duty Scams Home Jurors Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Section Menu What is a jury duty scam?Jury duty scams are fraudulent phone calls, text messages, emails, or in-person contact by individuals outside of the Judiciary that threatens arrest for failing to appear for jury duty. These messages demand payment or request confidential information that can be used for identity theft.How to identify a scamThe Judiciary does not use any money-transfer applications. Examples include PayPal, Venmo, or Cash App. Court officials will never ask for payment to avoid arrest for failing to report for jury duty and will never request personal identifiers, such as:Bank account or credit card numberSocial security numberPassport numberDriver's license numberTaxpayer identification numberMedical ID and/or Group numberThe Judiciary does use phone calls, text messages, and email communications to assist jurors with their service, but those communications will never ask for payment or personal identifiers other than date of birth and residential address.What to do if you suspect a scamIf you suspect fraudulent communication, do not respond and do not click on any links. Immediately contact your county jury management office as well as local law enforcement. ",
		"is_file": false,
		"child_pages": [
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors",
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/jurors/reporting"
		],
		"parent_pages": [
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/node/493161",
			"https://www.njcourts.gov/jurors"
		]
	},
	"https://www.njcourts.gov/jurors/general-jury-information": {
		"source": "website",
		"title": "General Jury Information | NJ Courts",
		"text": " General Jury Information Home Jurors Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Section Menu On This Page Body ADA Accommodation Requests and InformationIf an ADA accommodation or ASL interpreter is needed for your summons date and you would like additional information on the types of accommodations offered or how to request an accommodation, click Request an ADA Accommodation for assistance.Courthouse Closings/Inclement WeatherFor court closings and inclement weather, all jurors should check the State Court Closing Information page before reporting to the courthouse. Employed by State/Government AgenciesIf you are employed full time by a State of New Jersey agency, you will not get paid for your jury service as outlined with N.J.S.A. 2B:20-16. Your state agency employer will continue to pay your regular wages during your service. If you are unsure if you work for a state or government agency, contact your local jury management office. Participants who are employed by a state agency should provide this information when completing the paper or online questionnaire as well as notifying the jury management office when reporting for service. If a check is issued to you in error, you will be required to return it to the Jury Management Office directly.Employers Are Not Required to Pay Staff During Jury ServiceIn New Jersey there is no statutory requirement that a private employer pay your salary during juror service. It is in your best interest to speak with your employer before your summons date to determine whether your employer offers juror pay and for the number of days provided for jury service. Employers Cannot Penalize You for Jury ServiceN.J.S.A. 2B:20.17 prohibits an employer from penalizing you because you serve as a juror. Penalties for a violation of this statute include the possibility of a criminal charge, as a disorderly person’s offense, and a possible civil action for monetary damages and for reinstatement of employment. Juror QualificationN.J.S.A. 2B:20-1 establishes six criteria for a person to qualify for jury service:be a resident of New Jersey;be a citizen of the United States;be physically and mentally able to perform the functions of a juror (noting that the Judiciary will provide accommodations consistent with the Americans with Disabilities Act);have no conviction for an indictable offense Examples of persons who would be disqualified are anyone who was convicted of, or pled guilty to, a crime in federal court or Superior Court; or anyone currently in the Pretrial Intervention Program (PTI).Examples of persons who would qualify to serve jury duty are anyone whose only convictions are in municipal court (most traffic violations fall into this category, as do most shoplifting charges;) or anyone who has been accused of a crime but has not yet been convicted or has yet to enter a guilty plea.Also, traffic offenses, juvenile and DWI related offenses that occurred in New Jersey are not grounds for disqualification.You are not disqualified with respect to criminal record if you successfully completed a PTI for an offense and have not been convicted or pled guilty to another disqualifying offense.be at least 18 years of age; andbe able to read and understand the English languageJuror ScamsThe Judiciary will never ask for personal information or payments over the phone or by email. Contact your local jury management office if you have any concerns.The Judiciary will never request personal identifiers (such as social security numbers) or payment (credit card, checking, savings account information, etc.) for a fine for not going to jury duty over the phone or by e-mail.If you receive suspicious communication concerning jury duty, hang up and call or e-mail your local jury management office. If you believe you have been the victim of a jury duty scam, contact your local jury management office and law enforcement in your county.Phone Use in the CourtroomCellphone use in the courtroom is not permitted. You must not take any photographs or digital images, including ZOOM displays, or make any audio or video recordings of any kind. This includes broadcasting or posting any proceedings during your time in the courthouse.If you are found to have violated this directive by creating a photograph, digital image, audio, video, or other recording, you may be subject to punishment under New Jersey law.Phones must be concealed at all times. Exposed phones will be confiscated. Types of Jury Service & PaymentsPetit Jury ServiceQuestionnaires are required to be completed four days before the date of service.Petit jury is for civil and criminal trials. Petit jurors listen to evidence presented by both parties during a trial and return a verdict.The role of a juror is to listen to all the evidence presented and render a verdict at the end of the trial.12 jurors are typically selected for a civil or criminal trial.Jurors are paid $5 for the first three days of attendance and $40 for each day after.Watch a video about jury service.Grand Jury ServiceQuestionnaires are required to be completed four days before the date of service.Grand jury examines allegations against a person or persons charged with a crime. Grand jury does not determine guilt or innocence, but whether there is probable cause to believe that a crime was committed.The role of a grand juror is to determine whether there is enough evidence to charge someone with a crime.23 jurors are selected to be on a panel.Depending upon the county, the term of service for a panel can be from eight weeks to 20 weeks long.Jurors are paid $5 for each day they attend.State Grand Jury ServiceQuestionnaires are required to be completed 35 days before the date of service.State Grand Jury is a statewide program with jurors summoned from every county in New Jersey. If you are one of the 23 jurors selected, you will serve one day per week for 16 to 20 weeks.State Grand Jury is managed by the Mercer County Jury Management Office. Jury selection will be held virtually, and a Zoom link will be emailed to you the day before your summons date. If you are selected as a juror, you will be required to appear at:Richard Hughes Justice ComplexAdministrative Office of the Courts25 Market Street 4th FloorTrenton, NJ 08625 Jurors are paid $5 for each day they attend.Items Not Permitted in the CourthouseTo ensure everyone’s safety, all persons visiting the courthouse, including jurors, litigants, attorneys, employees, vendors, and other visitors, are subject to security screening when entering. Please allow sufficient time to pass through the court’s security system, as you will be required to walk through metal detection equipment.Illegal items will be confiscated and may subject you to prosecution.Prohibited Items:Weapons of any kindFirearmsKnives of any sizeSharp objects, scissors, or cutting tools of any typePepper sprayAerosol sprays or containersE-cigarettes or similar itemsAudio/visual equipment, including cameras, unless you have prior written permission from the court. ",
		"is_file": false,
		"child_pages": [
			"https://www.njcourts.gov/public/get-help/ada-court",
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/public/news-media/court-closings",
			"https://www.njcourts.gov/jurors",
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/jurors/reporting"
		],
		"parent_pages": [
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/node/493161",
			"https://www.njcourts.gov/jurors"
		]
	},
	"https://www.njcourts.gov/jurors/excusal-requests": {
		"source": "website",
		"title": "Excusal Requests",
		"text": " Excusal Requests Home Jurors Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Section Menu Excusal Requests & Required DocumentationComplete the juror qualification questionnaire before submitting a request to be excused.Mail or email all documentation to your county Jury Management Office for processing. The court will let you know if more information is needed for your request. Active duty of the United States militaryYou may request an excusal if you are on active duty.How: Submit your current assignment information. Use any of these: A copy of ordersA letter from your commanding officerA copy of ID card showing an active-duty assignment Active member of a volunteer fire department, fire patrol, first aid or rescue squadYou may request excusal if your volunteer service is required.How: Submit one of these:A letter from your captain on fire company letterhead. OR A copy of a current ID card showing active volunteer status. Financial HardshipYou may request an excusal if your service will make you unable to financially support yourself or your family.How: Submit the Certification in Support of Request to Be Excused from Jury Service Due to Severe Financial Hardship. The form must show all of these:Household income How much your employer will pay for jury service.The impact jury service will have on your ability to support yourself and your family. Full-time TeacherTeachers who cannot find a replacement may ask to reschedule their jury service. You may request an excusal if you are a full-time teacher and there is no way to find a substitute. How: Submit a letter from your school superintendent. The letter must say the following: You are a full-time teacher at a primary, middle, or secondary school: AND EITHERThe school requires you to be there because they do not have enough coverage ORYou are an essential special education teacher who is required to work. Healthcare WorkerYou may request an excusal if you are a healthcare worker under certain conditions: You are directly involved in the care of a person with a mental or physical disability, ANDYour continued presence is essential to the regular and personal treatment of that person. How: Submit a letter from your employer that says your continued presence is essential to the regular and personal treatment of the person. Medical ExcuseYou may request an excusal based on certain medical conditions:The condition must prevent you from serving on jury duty; ANDThe condition must be unlikely to change within a year.How: A licensed doctor must complete and submit the Physician Certification in Support of Medical Excuse Request form. Personal Obligation to Care for a Minor Child or ChildrenYou may request an excusal if you care for one or more minor children. There must be no other care available without causing a severe financial hardship. How: Complete the Certification in Support of Request for Excuse from Jury Service: Personal Obligation to Provide Care for Minor Child(ren). Personal Obligation to Care for a Sick, Aged, or Infirm DependentYou may request an excusal to care for a dependent in certain cases:You must be the only caregiver for that person. Your continued presence is essential to the regular and personal treatment of that person.How: Submit a letter from a doctor stating these facts. Provider of Highly Specialized Technical Healthcare ServicesYou may request an excusal if you provide certain healthcare services: You must be a provider of highly specialized technical healthcare services; ANDNo one else can replace you at your job.How: Submit copy of your medical license and a letter from your employer that says no one else can perform your work. Previous Jury Service Within the Last Three YearsYou may request an excusal if you completed jury service in the same county in the past three years. You will not be excused if your recent jury service was in federal or district court instead of state court. How: Submit the date you served in either Petit Jury, Grand Jury, or State Grand Jury within the last three years. ",
		"is_file": false,
		"child_pages": [
			"https://www.njcourts.gov/sites/default/files/forms/12140_jury_duty_childcare.pdf",
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/",
			"https://www.njcourts.gov/sites/default/files/forms/12255_jury_financial_hardship.pdf",
			"https://www.njcourts.gov/jurors",
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/jurors/reporting",
			"https://www.njcourts.gov/sites/default/files/forms/12308_physician_cert.pdf"
		],
		"parent_pages": [
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/node/493161",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/jurors"
		]
	},
	"https://www.njcourts.gov/sites/default/files/forms/12308_physician_cert.pdf": {
		"source": "website",
		"title": "12308_physician_cert.pdf",
		"text": "",
		"child_pages": [],
		"is_file": true,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors/faq#263381"
		]
	},
	"https://www.njcourts.gov/sites/default/files/forms/12255_jury_financial_hardship.pdf": {
		"source": "website",
		"title": "12255_jury_financial_hardship.pdf",
		"text": "",
		"child_pages": [],
		"is_file": true,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors/faq#263381"
		]
	},
	"https://www.njcourts.gov/jurors/service": {
		"source": "website",
		"title": "Complete Your Questionnaire | NJ Courts",
		"text": " Complete Your Questionnaire Home Jurors Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Section Menu Body Log-In to My Jury Service PortalLOG INInstructions for logging into the My Jury Service PortalEnter your 10-digit Participant ID (including all zeros), located under the barcode on your summons.Enter your 5-digit zip code as it appears on your summons.Enter your last name as it appears on your Summons Postcard. *Note: If you update your name with your jury management office, you will then use your corrected last name when logging in. If you require an ADA accommodation or ASL interpreter, please click Request an ADA Accommodation for more information or to make a request.Video Instructions Using the My Jury Service Portal (MJS)How to create a Juror Service RequestHow to view Attendance and Payment InformationHow to update Personal Profile Information (Address, Phone #, etc.)Quick Reference Guide - My Jury Service Portal (MJS)Where to find login information:Postcard Summons Letter SummonsIf you did not respond to the postcard summons you can find the login information on the follow-up letter summons. Recommended Internet BrowsersUse Google Chrome, Microsoft Edge, Safari, or Firefox for the best experience on the My Jury Service Portal.Check Juror Reporting MessageAfter completing the questionnaire, check the jury reporting message after 5:30 p.m. the night before your summons date(s) at Check Jury Reporting.Contact InformationFor issues logging into the MJS Portal, email JurorTechHelp.mbx@njcourts.gov .You can also call your county jury manager for more information about the portal or about your jury service.The statewide call center at 609-421-6100 can also assist with login issues. ",
		"is_file": false,
		"child_pages": [
			"https://www.njcourts.gov/public/get-help/ada-court",
			"https://www.njcourts.gov/",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/sites/default/files/jurors/quickreferenceguide-jury.pdf",
			"https://www.njcourts.gov/jurors",
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/jurors/reporting"
		],
		"parent_pages": [
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/node/493161",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/jurors",
			"https://www.njcourts.gov/jurors/faq#828316"
		]
	},
	"https://www.njcourts.gov/sites/default/files/jurors/quickreferenceguide-jury.pdf": {
		"source": "website",
		"title": "quickreferenceguide-jury.pdf",
		"text": "",
		"child_pages": [],
		"is_file": true,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/jurors/faq#828316"
		]
	},
	"https://www.njcourts.gov/sites/default/files/forms/12140_jury_duty_childcare.pdf": {
		"source": "website",
		"title": "12140_jury_duty_childcare.pdf",
		"text": "",
		"child_pages": [],
		"is_file": true,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/jurors/faq#263381"
		]
	},
	"https://www.njcourts.gov/sites/default/files/jurors/testingzoomcomp.pdf": {
		"source": "website",
		"title": "testingzoomcomp.pdf",
		"text": "",
		"child_pages": [],
		"is_file": true,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/videoconference-instructions"
		]
	},
	"https://www.njcourts.gov/sites/default/files/jurors/testingzoomios.pdf": {
		"source": "website",
		"title": "testingzoomios.pdf",
		"text": "",
		"child_pages": [],
		"is_file": true,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/videoconference-instructions"
		]
	},
	"https://www.njcourts.gov/node/493161": {
		"source": "website",
		"title": "Jury Management Office Contact List | NJ Courts",
		"text": " Jury Management Office Contact List Home Jurors Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Jurors Main navigation Complete Your Questionnaire Contact Jury Manager Excusal Requests FAQs General Jury Information New Jersey State Grand Jury Protect Yourself Against Jury Duty Scams Reporting Information Rescheduling Requests Videoconference Instructions Section Menu If you are calling about jury service, be prepared to provide your name, and the nine digit number shown under the bar code on your juror summons. That information will allow Jury Management Office staff to answer your questions more quickly and more directly. For State Grand Jury in Trenton, please contact jury staff at 609-571-4497 or send an email to sgjury.mailbox@njcourts.gov . Name Address Contact (s) AtlanticFeliciano, Geovanny Jury ManagerAtlantic CityAtlantic Atlantic County Civil Courts Building1201 Bacharach Blvd.Floor 1 Atlantic City, New Jersey 08401 Phone: 609-402-0100 ext. 47930 Email: atljuryac.mbx@njcourts.gov AtlanticHeadley, Janice Jury ManagerMays LandingAtlantic Atlantic County Criminal Courts Complex4997 Unami Blvd.Floor 1 Mays Landing, New Jersey 08330 Phone: 609-402-0100 ext. 47940 Email: Atljury.Mailbox@njcourts.gov BergenFigueroa, Lourdes Jury ManagerBergen Bergen County Justice Center10 Main StreetFloor 5 Hackensack, New Jersey 07601 Phone: 201-221-0700 ext. 25090 Email: Berjury.Mailbox@njcourts.gov BurlingtonWilson, Lisa Jury ManagerBurlington Courts Facility49 Rancocas RoadFloor 5 Mount Holly, New Jersey 08060 Phone: 609-288-9500 ext. 38031 Email: Burjury.Mailbox@njcourts.gov CamdenMatlock, Lashonna Jury ManagerCamden Camden County Hall of Justice101 South 5th StreetFloor 6 Camden, New Jersey 08103 Phone: 856-650-9085 Email: Camjury.Mailbox@njcourts.gov Cape MayFeliciano, Geovanny Jury ManagerCape May Cape May County Courthouse9 North Main StreetFloor 1 Cape May Courthouse, New Jersey 08210 Phone: 609-402-0100 ext. 47950 Email: Cpmjury.Mailbox@njcourts.gov CumberlandBuonogaimari, Maria Jury Manager - CumberlandCumberland Cumberland County Courthouse60 West Broad StreetFloor 2 Bridgeton, New Jersey 08302 Phone: 856-878-5050 ext. 15160 Email: Cumjury.Mailbox@njcourts.gov EssexBrooks, Rachel Jury ManagerEssex Essex County Veterans Courthouse50 West Market StreetFloor 8 Newark, New Jersey 07102 Phone: 973-776-9300 ext. 56887 Email: Esx-jury.Mailbox@njcourts.gov GloucesterCline, Ashley Jury Manager - GloucesterGloucester Gloucester County Justice Complex70 Hunter StreetFloor 1 Woodbury, New Jersey 08096 Phone: 856-878-5050 ext. 15180 Email: Glojury.Mailbox@njcourts.gov HudsonOrtiz, Raquel Jury ManagerHudson Hudson County Administration Bldg595 Newark AvenueFloor 4 Jersey City, New Jersey 07306 Phone: 201-748-4400 ext. 60560 Email: Hudjury.Mailbox@njcourts.gov HunterdonGuinan, Amy Jury Manager - HunterdonHunterdon Hunterdon County Justice Center65 Park AvenueFloor 1 Flemington, New Jersey 08822 Phone: 908-824-9750 ext. 13030 Email: Hntjury.Mbx@njcourts.gov MercerSeidl, Dale Jury ManagerMercer Mercer County Civil Courthouse175 South Broad StreetFloor 2 Trenton, New Jersey 08650-0068 Phone: 609-571-4200 ext. 74375 Email: Merjury.Mailbox@njcourts.gov MiddlesexSeide, Vanessa Jury ManagerMiddlesex Middlesex County Courthouse56 Paterson StreetFloor 1 New Brunswick, New Jersey 08903-0964 Phone: 732-645-4300 ext. 88630 Email: Midjury.Mailbox@njcourts.gov MonmouthD'Annunzio, Francesca Jury ManagerMonmouth Monmouth County Courthouse71 Monument StreetFloor 1 Freehold, New Jersey 07728 Phone: 732-358-8700 ext. 87075 Email: Monjury.Mailbox@njcourts.gov MorrisPerez, Elvin Jury ManagerMorris Morris County CourthouseWashington and Court StreetsMorristown, New Jersey 07960-0910 Phone: 862-397-5700 ext. 75060 Email: Mrsjury.Mailbox@njcourts.gov OceanRiley, Karen Jury ManagerOcean Ocean County Courthouse100 Hooper AvenueFloor 2 Toms River, New Jersey 08754 Phone: 732-504-0633 Email: Ocnjury.Mailbox@njcourts.gov PassaicCaltagirone, Stacey Jury ManagerPassaic Passaic County Admin Building401 Grand StreetSuite/Room 325, Floor 3rd Floor Paterson, New Jersey 07505 Phone: 973-653-2980 Email: Pasjurymgmt.Mailbox@njcourts.gov SalemHolmes, Diane Jury Manager - SalemSalem Salem County Courthouse92 Market StreetFloor Lower Level Salem, New Jersey 08079 Phone: 856-878-5050 ext. 15760 Email: Slmjury.Mailbox@njcourts.gov SomersetBrevic, Jason Jury Manager - SomersetSomerset Somerset County Courthouse20 North Bridge StreetFloor 2 Somerville, New Jersey 08876 Phone: 908-332-7700 ext. 13025 Email: Somjury.mbx@njcourts.gov SussexStolzenberger, Karen Jury ManagementSussex Sussex County Judicial Center43-47 High StreetNewton, New Jersey 07860 Phone: 862-397-5700 ext. 75080 Email: Ssxjury.Mailbox@njcourts.gov UnionTenBroeck, William Jury ManagerUnion Union County Courthouse2 Broad StreetFloor 1 Elizabeth, New Jersey 07207 Phone: 908-787-1650 ext. 84620 Email: Unnjury.mailbox@njcourts.gov WarrenMurzdeck, Christine Jury ManagerWarren Warren County Courthouse413 Second StreetFloor 2 Belvidere, New Jersey 07823 Phone: 908-750-8100 ext. 13010 Email: wrnjury.mbx@njcourts.gov Total results: 22 ",
		"is_file": false,
		"child_pages": [
			"https://www.njcourts.gov/courts/vicinages/atlantic-cape-may",
			"https://www.njcourts.gov/jurors/service",
			"https://www.njcourts.gov/courts/vicinages/cumberland-gloucester-salem",
			"https://www.njcourts.gov/courts/vicinages/burlington",
			"https://www.njcourts.gov/jurors/videoconference-instructions",
			"https://www.njcourts.gov/courts/vicinages/somerset-hunterdon-warren",
			"https://www.njcourts.gov/courts/vicinages/morris-sussex",
			"https://www.njcourts.gov/courts/vicinages/bergen",
			"https://www.njcourts.gov/courts/vicinages/mercer",
			"https://www.njcourts.gov/jurors/faq",
			"https://www.njcourts.gov/courts/vicinages/middlesex",
			"https://www.njcourts.gov/jurors/protect-yourself-against-jury-duty-scams",
			"https://www.njcourts.gov/jurors/contact",
			"https://www.njcourts.gov/courts/vicinages/monmouth",
			"https://www.njcourts.gov/courts/vicinages/union",
			"https://www.njcourts.gov/",
			"https://www.njcourts.gov/courts/vicinages/essex",
			"https://www.njcourts.gov/courts/vicinages/passaic",
			"https://www.njcourts.gov/jurors",
			"https://www.njcourts.gov/courts/vicinages/atlantic-city",
			"https://www.njcourts.gov/jurors/general-jury-information",
			"https://www.njcourts.gov/jurors/new-jersey-state-grand-jury",
			"https://www.njcourts.gov/courts/vicinages/ocean",
			"https://www.njcourts.gov/jurors/excusal-requests",
			"https://www.njcourts.gov/courts/vicinages/camden",
			"https://www.njcourts.gov/jurors/rescheduling-requests",
			"https://www.njcourts.gov/jurors/reporting",
			"https://www.njcourts.gov/courts/vicinages/hudson"
		],
		"parent_pages": [
			"https://www.njcourts.gov/jurors/videoconference-instructions"
		]
	},
	"https://www.njcourts.gov/sites/default/files/jurors/testingzoomweb.pdf": {
		"source": "website",
		"title": "testingzoomweb.pdf",
		"text": "",
		"child_pages": [],
		"is_file": true,
		"parent_pages": [
			"https://www.njcourts.gov/jurors/videoconference-instructions"
		]
	}
}
